// Task 1 პირობა: HTML-გვერდიდან მომხმარებელს მოსთხოვეთ input-ტეგის მეშვეობით შეიტანოს მისთვის საყვარელი საჭმელის ჩამონათვალი მძიმეებით გამოყოფილი, მაგ.აჭმელი1, საჭმელი2, საჭმელი3, საჭმელი4. ამის შემდეგ თქვენ გააკეთეთ ისე, რომ filter() მეთოდის მეშვეობით გაფილტროთ მონაცემები და HTML გვერდზე გამოიტანოთ ტექსტი (მაგ. p ტეგით) იმაზე, თუ რომელი საჭმელია სასარგებლო ჯანმრთელობისთვის და რომელია საზიანო. ტექსტის მაგ. “თქვენს მიერ შეტანილი საჭმელებიდან საჭმელი1 თქვენთვის სასარგებლოა, საჭმელი2 სასარგებლოა, მაგრამ უვარგისია საჭმელი3, საჭმელი4.
// *********************
//
// es ver gavakete. naxevramde mivdivar da mere viwedebi
//
//***********************
// Task 2 პირობა: HTML-გვერდში შექმენით ველი, რომლითაც მომხმარებელს შეეძლება შეიტანოს რაიმე ინგლისური წინადადება, ხოლო თქვენ კი .map() მეთოდის მეშვეობით გააკეთეთ ისე, რომ ამ წინადადების პირველი ასობგერა და ასევე ყველა ის პირველი ასობგერა წერტილის შემდეგ რაც იქნება მოცემული მაღალ რეგისტრში დაიწეროს. (upper case-ში). მაგ. hello here my dear. i want to visit you. სწორ ფორმატში უნდა გამოუტანოთ როგორც: Hello here my dear. I want to visit you. (H და I, დიდ ასობგერებში დაიწერა)
// **********************

function submitText() {
  let text = document.getElementById("inputText").value;
  text = text.split(". ");
  console.log(text);
  let updatedText = text.map(
    (update) => update.charAt(0).toUpperCase() + update.slice(1)
  );
  document.getElementById("result").innerHTML = updatedText;
}
